{"1399":{"bioID":"1399","bioName":"Bill & Leah Hotaling","bioCareerTitle":"Owners","bioImageID":"","bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/bill-leah.jpg","bioContent":"<strong>Bill Hotaling<\/strong> began his dance training in New York City. Since then, he has performed on stages throughout the world, from Radio City Music Hall in NY to the World Design Expo in Japan. He has appeared in music videos for groups such as Cameo and Sweet Obsession, and performed in many industrials for companies such as AT&amp;T and IBM. You can see him in commercials for “Rascals” candy and “Miller Ultra” beer as well as in the film <em>When Harry Met Sally<\/em>.  <br><br>Teaching and Choreographing have become his main focus. In New York City he has taught at three of the most successful dance studios: Broadway Dance Center, Steps on Broadway and Central Park Dance Studio He has choreographed theatrical productions of <em>“Chicago”<\/em>, <em>“The Music Man”,<\/em> <em>“Fiddler on the Roof”<\/em> and <em>“Pippin”.<\/em> <br> <br>He travels extensively, teaching workshops and master classes for the leading dance organizations (Manhattan Dance Project, Dance Masters of America, Dance Caravan…), colleges and universities (Disney American College, Columbia University…), and over 200 dance studios around the world. Most recently, Bill has taught jazz &amp; lyrical at the School of Ballet Arizona and at Arizona School of the Arts in Phoenix, AZ and the Poznan Dance Festival in Poland. He is the founder of the Manhattan Dance Project.<br><br><strong>Leah Hotaling<\/strong> was a Radio City Rockette for five years and has taught master classes on the Rockette style across the country. Her classes give students the opportunity to learn the precision technique that has made the Rockettes famous all over the world.<br><br>Leah has also performed at the movie premiers for <em>Moulin Rouge<\/em> starring Nicole Kidman and Disney’s <em>102 Dalmatians<\/em> starring Glen Close.   She has danced for Chita Rivera in a benefit show choreographed by Tony award winner Chet Walker. Leah has appeared in numerous dance instructional videos as well as on television and radio as a public relations spokesperson for Radio City Music Hall.<br><br>When she is not at the studio she enjoys spending her time with her children, Will and Drew, and husband, Bill.","bioLink":"https:\/\/dev.jdigital.studio\/bios\/1399\/"},"1167":{"bioID":"1167","bioName":"Marco Leal","bioCareerTitle":"Studio Manager \/ Company Director","bioImageID":1708,"bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/marco-leal.jpeg","bioContent":"<strong>Marco Leal<\/strong> has been teaching for Conservatory of Dance since 2011.  With an athletic background, he won regional and national awards along with scholarships at prestigious conventions such as LA Dance Magic, Nuvo, and Jump.<br><br>He has worked with well-known choreographers Jackie Sleight and Wes Veldink. Marco has also studied under Justin Giles.  Marco has worked with our performance companies in many capacities teaching master classes, choreography, and co-directs shows at high schools across the valley.","bioLink":"https:\/\/dev.jdigital.studio\/bios\/marco-leal\/"},"1170":{"bioID":"1170","bioName":"Kelsey Metz","bioCareerTitle":"Company Choreographer","bioImageID":"","bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/21COFD_Faculty_KelseyMets-800.jpg","bioContent":"<strong>Kelsey Metz<\/strong> began her dance training in a variety of styles in Arizona.  Her dance education growing up had strong focuses in Jazz, Ballet, Lyrical Tap, and Hip Hop at Dance Connection and Master Ballet Academy.  She began traveling for dance at the age of 11 and enjoyed learning from Master Teachers throughout the country.  At the age of 18, Kelsey began teaching and choreographing locally in Arizona whilst continuing to dance professionally.<br><br>Throughout her career as a Dancer, Kelsey has worked with many choreographers and artists including Mandy Moore, Peter Chu, Liz Imperio, Jess Hendrix, Ray Leeper, and Dana Metz.  Kelsey has performed around the country in theaters such as the Dorothy Chandler Pavilion, the El Portal, New York Civic Center, the Roseland Ballroom, Majestic Theatre, and several other local theaters in AZ.  She currently performs with the Bread Dance Contemporary Company (Phoenix, AZ) and is thrilled to begin her 10th Season teaching and directing at Conservatory of Dance (Phoenix, AZ).<br><br>Kelsey enjoys sharing her passion for dance with the younger generation and continues to expand her own personal Dance Education.  Kelsey has completed several professional dance intensives throughout the past few years including education in Countertechnique and Gaga movement language.  She recently completed her certification in Progressive Ballet Technique and Giordano Jazz Technique.  Kelsey hopes to never stop developing her own personal movement and is excited to share her knowledge through dancing, teaching and choreographing.","bioLink":"https:\/\/dev.jdigital.studio\/bios\/kelsey-metz\/"},"1175":{"bioID":"1175","bioName":"Hillary Conrad-zbyszinski","bioCareerTitle":"Studio Manager \/ Zbyszinski","bioImageID":1709,"bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/20COFD_HillaryZ-1200.jpg","bioContent":"<strong>Hillary<\/strong> is a choreographer, teacher and performer in Phoenix, Arizona.  She has earned a Bachelors of Performing Arts in Dance Performance at Oklahoma City University and currently is on staff at Conservatory of Dance in Phoenix.<br><br>Along with teaching dance, Hillary has choreographed several full length musicals for Scottsdale Musical Theater Company.  Some of her favorite choreography credits include “Annie” starring Bronson Pinchot and Kaitlyn Hopkins, Assistant Choreographer to Eloise Kropp for “42nd Street” also starring Debby Boone and Charles Shaughnessy and “A Christmas Carol: The Musical”.<br><br>Her performing credits include Loraine in “42nd Street,” Velma in “West Side Story,” and Hot Box girl in “Guys and Dolls” where she served as the dance captain.  Additionally, Hillary enjoys performing with the tap company “Tap 24.7”.<br><br>Hillary is currently sharing her passion for dance and loves to see the excitement on kids’ faces whether they are having fun or finally mastering that difficult step in their dance journey.","bioLink":"https:\/\/dev.jdigital.studio\/bios\/1175\/"},"1179":{"bioID":"1179","bioName":"Sharon Luchs","bioCareerTitle":"Youth Program Director","bioImageID":1712,"bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/8-Sharon-Luchs-1.png","bioContent":"<strong>Sharon Luchs<\/strong> has been teaching at Conservatory of Dance since 2015, following fourteen years with Agoura Hills Dance and Performing Arts Center in Agoura Hills, CA, where she taught, directed and choreographed for all levels and ages, from preschool to adult, including annual choreography for the full-length ballet Alice in Wonderland.<br>Sharon’s teaching credits span all levels of dance instruction, ranging from preschool movement to adult ballet, pointe and technique, and include extended teaching engagements in New York City at the Callina Moraytis School of Classical Ballet as well as the Learning Annex, and in Raleigh, NC at Danceurs Studio. While in Raleigh, she served as a multiple presenter in Dance Education for the North Carolina Association for the Education of Young Children.<br><br>For several years, Sharon was a judge for On Stage America’s regional dance competitions on both coasts. After graduating from East Carolina University with a B.F.A. in Dance, she performed extensively as Principal Dancer with both the North Carolina State Ballet and East Carolina Dance Theatre before concluding her post-graduate studies as a scholarship recipient at Harkness House in New York City.<br><br>In Phoenix, Sharon has taught at Ballet Theatre of Phoenix and choreographed for Convergence Ballet’s Alice in Wonderland.","bioLink":"https:\/\/dev.jdigital.studio\/bios\/sharon-luchs\/"},"1181":{"bioID":"1181","bioName":"Serena Christianson","bioCareerTitle":"Tap","bioImageID":1710,"bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/faculty-serena-800.jpg","bioContent":"<strong>Serena Christianson<\/strong> began studying dance at the age of three at Jack Dyville’s Dance Factory in Williston, North Dakota.  When she was in the fourth grade, she was asked to be a part of Kids Company, a youth competition team at the Dance Factory.  In seventh grade, she was a member of the B Company troupe, advancing to A Company the following year.  Throughout her tenure at the Dance Factory, she won multiple awards at International Dance Challenge, Spotlight Dance Cup, Hollywood Vibe Dance Competition, Dance Challenge, Montana Dance Challenge, and I Love Dance Competition.<br><br>In 2012, Christianson and her sister co-founded Kay Michael Lee Studio, “The Region’s Premier Source for Dance” in Williston, North Dakota.  Their full-service dance studio offers ballet, tap, jazz, hip hop, ballet, pointe, musical theatre, and contemporary classes for students ages 2 and up.  In addition to recreation classes, they offer an award-winning competition program.  Their Competition Company has performed and competed in North Dakota, Montana, Colorado, Minnesota, Wisconsin, Arizona, and Florida.  Her students have received many top honors for their performance and technique abilities at regional and national competitions.<br><br>Christianson earned her personal fitness trainer certification through AFAA (Aerobics and Fitness Association of America) in December 2012.  In 2015, she received the Certification in the Jazz Dance Technique &amp; Syllabus by James Robey.  In the spring 2018 term, Christianson taught an introductory tap class at Arizona State University.  Since 2016, she has taught the advanced tap classes at the Conservatory of Dance in Phoenix.","bioLink":"https:\/\/dev.jdigital.studio\/bios\/serena-christianson\/"},"1184":{"bioID":"1184","bioName":"Kelly Snailum","bioCareerTitle":"Pilates","bioImageID":1711,"bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/fa-kelly-800.jpg","bioContent":"<strong>Kelly<\/strong> is a PMA Certified Master Pilates and Barre Teacher Trainer. She has been teaching Pilates well over a decade and opened Remedy Pilates &amp; Barre in 2008.  Recognized across the Valley as an educator and advocate of the Pilates method.<br><br>As the depth of her practice grows, she continues to find the passion and power of Pilates each year.  “I strive to constantly be creative and innovative with the tools we are fortunate enough to work with. I enjoy working towards all types of goals from movement to transformation and do my best to stay on top of current trends, injury prevention and common problems. I think a well-rounded instructor can take on all client cases if they are determined to educate themselves for the betterment of their client.”<br><br>Kelly donates countless hours, hosts complimentary events and participates in charity auctions all over the Valley in hopes to spread the gift of Pilates and Barre.  When she is not teaching Pilates, Barre or TRX, you can find Kelly training for her next marathon or summit challenge, hanging out with her family – Mason and Dera Rae and husband, Rick, or snuggling up with her three puppies, Milly, Iggy and Chance.","bioLink":"https:\/\/dev.jdigital.studio\/bios\/kelly-snailum\/"},"1187":{"bioID":"1187","bioName":"Christina Spigner","bioCareerTitle":"Ballet Director","bioImageID":"","bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/ChristinaSpigner-800.jpg","bioContent":"Paradise Valley native Christina Spigner recently retired from a decade-plus career with the world-renown Miami City Ballet (MCB). During her tenure, Christina served as the Company’s only Black female dancer. In light of her experience, Christina felt compelled to pursue a Diversity, Equity, and Inclusion (DEI) certification post-retirement and had the opportunity through her role on MCB’s administrative team to research and interview premiere ballet companies and schools nationally regarding their DEI work. This experience further equipped her and fueled her desire to uplift the next generation of young dancers through the message of inclusivity, belonging, and self-love. <br><br>As a ballet instructor, Christina is a strong advocate for approaching technique, flexibility, and dance performance holistically. She accomplishes this by sharing her knowledge of body awareness and strength training programs such as Gyrotonics, Pilates, and Feldenkrais. Additionally, Christina is a certified Progressing Ballet Technique teacher, a favorite body-conditioning regimen of top ballet companies and schools worldwide.<br><br> Since the early days of her training, Christina attended many of the nation’s leading ballet institutions, including Master Ballet Academy, Pacific Northwest Ballet School, Ballet Maestro, Interlochen Arts Camp, and The School of Ballet Arizona. Christina’s first break on the main stage was in 2004 as Ballet Arizona’s first Black Clara in George Balanchine’s The Nutcracker. <br><br>At the age of 15, Christina moved to Miami to attend the Miami City Ballet School and, only one year later, was offered a company apprenticeship by founder and New York City Ballet legend Edward Villella. As a sought-after ballerina, Christina’s career featured a diverse array of repertory in soloist and principal roles, including Balanchine’s The Four Temperaments (Sanguinic), Paul Taylor’s Company B (Mary\/Rum and Coke), a triple threat performance in Jerome Robbins’ West Side Story Suite (Rosalia), and more. Additionally, she enjoyed a robust national and international touring schedule dancing on some of the world’s greatest stages and most prestigious dance festivals, including; New York City Center for The Balanchine Festival: The City Center Years (NYC), The Kennedy Center for Ballet Across America (D.C.), The Spoleto Festival (Charleston), The Koch Theater (NYC), Radio City Music Hall (NYC), The Harris Theater (Chicago), The Queen Elizabeth Theater (Vancouver), and Northrop Auditorium (Minneapolis). <br><br>Outside of Miami City Ballet, Christina has been a featured guest artist with Peter London Global Dance Company (Miami) and The Black Iris Project (NYC). The Black Iris Project, a nationally acclaimed ballet company, creates new and relevant classical ballet works celebrating diversity and Black history. In 2016, Christina made her Ballet Across America festival debut at the Kennedy Center by way of Misty Copeland’s nomination of the Black Iris Project. <br><br>Winner of numerous awards and honors, Christina was a nominee for the Princess Grace Award, winner of three national contemporary dance competitions, and awarded as one of Miami’s 40 Under 40 Black Leaders of Today and Tomorrow. Christina has been featured in a variety of publications and national marketing campaigns for her dancing and teaching, including Dance Magazine, Dance Spirit, Dance Teacher, The Miami Herald, City &amp; Shore, two Miami City Ballet campaigns, and a national dancewear campaign for SoDança (2017-2018). <br><br>“Despite your background, or past difficulties feeling like you fit into the mold of “ballet,” I feel the importance of contributing to the field as a diverse educator, allowing other diverse young dancers the opportunity to have representation, find belonging in this art form, and learn to love themselves within it. I want to be an active contributor to the world of ballet, especially in the mental health space. My passion is to share with young students how to relate to ballet and themselves in a way that is healthy and honoring.”","bioLink":"https:\/\/dev.jdigital.studio\/bios\/christina-spigner\/"},"1190":{"bioID":"1190","bioName":"Maddi Maloscia","bioCareerTitle":"Jazz \/ Lyrical","bioImageID":"","bioImageURL":"https:\/\/dev.jdigital.studio\/wp-content\/uploads\/2023\/11\/maddi-miloscia.jpg","bioContent":"Architecto reprehenderit doloribus ut. Fugit necessitatibus distinctio qui autem sequi quod audantium et. Quibusdammollitia voluptatem aspernatur. Explicabo quibusdam voluptatem ut ratione veritatis possimus. Sunt occaecati et sit esse inventore labore qui autem adipisci Excepturi eum illum nam","bioLink":"https:\/\/dev.jdigital.studio\/bios\/maddi-maloscia\/"}}